Repository: devameer/pscc_wordpress
Catalog: resources/languages/*.po
Languages: ar

source: Annual Reports
ar: التقارير السنوية

source: Annual Report
ar: تقرير سنوي

source: Add New Annual Report
ar: إضافة تقرير سنوي جديد

source: Edit Annual Report
ar: تعديل التقرير السنوي

source: New Annual Report
ar: تقرير سنوي جديد

source: View Annual Report
ar: عرض التقرير السنوي

source: Search Annual Reports
ar: البحث في التقارير السنوية

source: No annual reports found
ar: لم يتم العثور على تقارير سنوية

source: No annual reports found in Trash
ar: لا توجد تقارير سنوية في سلة المهملات

source: All Annual Reports
ar: جميع التقارير السنوية

source: Publications
ar: المنشورات

source: Publication
ar: منشور

source: Add New Publication
ar: إضافة منشور جديد

source: Edit Publication
ar: تعديل المنشور

source: New Publication
ar: منشور جديد

source: View Publication
ar: عرض المنشور

source: Search Publications
ar: البحث في المنشورات

source: No publications found
ar: لم يتم العثور على منشورات

source: No publications found in Trash
ar: لا توجد منشورات في سلة المهملات

source: All Publications
ar: جميع المنشورات

source: Annual Report Details
ar: تفاصيل التقرير السنوي

source: Report Year
ar: سنة التقرير

source: Enter the year of this report (e.g., 2024).
ar: أدخل سنة هذا التقرير (مثال: 2024).

source: PDF File URL
ar: رابط ملف PDF

source: Paste any download URL for the PDF file.
ar: الصق أي رابط تحميل لملف PDF.

source: File Name
ar: اسم الملف

source: Enter the display name for the download file (e.g., "Annual Report 2024").
ar: أدخل الاسم المعروض لملف التحميل (مثال: "التقرير السنوي 2024").

source: File Size
ar: حجم الملف

source: Enter the file size (e.g., "2.5 MB").
ar: أدخل حجم الملف (مثال: "2.5 ميجابايت").

source: Download Button Text
ar: نص زر التحميل

source: Custom text for the download button.
ar: نص مخصص لزر التحميل.

source: Download Report
ar: تحميل التقرير

source: Publication Details
ar: تفاصيل المنشور

source: Publication Year
ar: سنة المنشور

source: Enter the year of this publication (e.g., 2024).
ar: أدخل سنة هذا المنشور (مثال: 2024).

source: Enter the display name for the download file (e.g., "Publication 2024").
ar: أدخل الاسم المعروض لملف التحميل (مثال: "المنشور 2024").

source: Download Publication
ar: تحميل المنشور

source: Year
ar: السنة

source: No Annual Reports Found
ar: لم يتم العثور على تقارير سنوية

source: Check back soon for the latest reports.
ar: تحقق قريباً للحصول على أحدث التقارير.

source: No Publications Found
ar: لم يتم العثور على منشورات

source: Check back soon for the latest publications.
ar: تحقق قريباً للحصول على أحدث المنشورات.

source: Reports pagination
ar: ترقيم صفحات التقارير

source: Publications pagination
ar: ترقيم صفحات المنشورات

source: No annual reports found. Please add some via the dashboard.
ar: لم يتم العثور على تقارير سنوية. يرجى إضافة بعضها عبر لوحة التحكم.

source: No publications found. Please add some via the dashboard.
ar: لم يتم العثور على منشورات. يرجى إضافة بعضها عبر لوحة التحكم.

source: Annual Reports Page Settings
ar: إعدادات صفحة التقارير السنوية

source: Publications Page Settings
ar: إعدادات صفحة المنشورات

source: Hero Section
ar: قسم البطل

source: Custom Title
ar: عنوان مخصص

source: Leave blank to use the page title.
ar: اتركه فارغاً لاستخدام عنوان الصفحة.

source: Download
ar: تحميل

source: Add New
ar: إضافة جديد

source: Image
ar: صورة
